<template>
    <div class="popup-aside__bet-exprexx bet-express" :class="{'bet-ordenar_close-status':activStatus == false}">
    
        <div class="bet-ordenar__header bet-express__header">
            <div class="bet-ordenar__heder-title">
                <div class="bet-ordenar__live" >Live</div>
                <p class="bet-ordenar__text">Ханшин Тайгерз -  Токио Якульт Сваллоус</p>
            </div>
            <div class="bet-ordenar__close-icon">
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <mask id="mask0_2084_7687" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="20" height="20">
                    <rect width="20" height="20" fill="#D9D9D9"/>
                    </mask>
                    <g mask="url(#mask0_2084_7687)">
                    <path d="M9.99924 8.84828L14.1441 4.70339C14.2969 4.55061 14.4914 4.47422 14.7275 4.47422C14.9636 4.47422 15.158 4.55061 15.3108 4.70339C15.4636 4.85616 15.54 5.05061 15.54 5.28672C15.54 5.52283 15.4636 5.71727 15.3108 5.87005L11.1659 10.0149L15.3172 14.1454C15.47 14.2982 15.5464 14.4926 15.5464 14.7288C15.5464 14.9649 15.47 15.1593 15.3172 15.3121C15.1644 15.4649 14.97 15.5413 14.7339 15.5413C14.4978 15.5413 14.3033 15.4649 14.1506 15.3121L9.99924 11.1608L5.87302 15.3078C5.72024 15.4606 5.5258 15.537 5.28969 15.537C5.05358 15.537 4.85913 15.4606 4.70635 15.3078C4.53969 15.1412 4.45635 14.9432 4.45635 14.7141C4.45635 14.4849 4.53969 14.2939 4.70635 14.1412L8.85341 10.0149L4.71062 5.87215C4.55784 5.71937 4.48145 5.52493 4.48145 5.28882C4.48145 5.05271 4.55784 4.85826 4.71062 4.70549C4.87728 4.53882 5.0752 4.45549 5.30436 4.45549C5.53353 4.45549 5.7245 4.53882 5.87728 4.70549L9.99924 8.84828Z" fill="#8696AD"/>
                    </g>
                </svg> 
            </div>
        </div>

        <div class="bet-express__body">
            <p class="bet-ordenar__winner">Победитель</p>
            <div class="bet-ordenar__row">
                <p class="bet-ordenar__winner-name">Ханшин Тайгерз</p>
                <div class="bet-ordenar__cof-wrapper" v-if="activStatus">

                    <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M8.64365 10.4437L5.9789 7.77764C5.94215 7.74076 5.91459 7.70089 5.89621 7.65801C5.87784 7.61514 5.86865 7.57183 5.86865 7.52808C5.86865 7.44058 5.89959 7.36401 5.96147 7.29839C6.02334 7.23276 6.1049 7.19995 6.20615 7.19995H11.7937C11.8949 7.19995 11.9765 7.2337 12.0383 7.3012C12.1002 7.3687 12.1312 7.44745 12.1312 7.53745C12.1312 7.54995 12.0944 7.62976 12.0209 7.77689L9.35615 10.4437C9.30615 10.4937 9.2499 10.5312 9.1874 10.5562C9.1249 10.5812 9.0624 10.5937 8.9999 10.5937C8.9374 10.5937 8.8749 10.5812 8.8124 10.5562C8.7499 10.5312 8.69365 10.4937 8.64365 10.4437Z" fill="#FA305C"/>
                    </svg>
                        
                    <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M6.20615 10.8C6.1049 10.8 6.02334 10.7662 5.96147 10.6987C5.89959 10.6312 5.86865 10.5525 5.86865 10.4625C5.86865 10.45 5.9054 10.3702 5.9789 10.2231L8.64365 7.55625C8.69365 7.50625 8.7499 7.46875 8.8124 7.44375C8.8749 7.41875 8.9374 7.40625 8.9999 7.40625C9.0624 7.40625 9.1249 7.41875 9.1874 7.44375C9.2499 7.46875 9.30615 7.50625 9.35615 7.55625L12.0209 10.2223C12.0577 10.2592 12.0852 10.2991 12.1036 10.3419C12.122 10.3848 12.1312 10.4281 12.1312 10.4719C12.1312 10.5594 12.1002 10.6359 12.0383 10.7016C11.9765 10.7672 11.8949 10.8 11.7937 10.8H6.20615Z" fill="#00BD71"/>
                    </svg>
                        
                    <div class="bet-ordenar__cof">1,30</div>
                </div>

                <div v-else class="bet-ordenar__close-warning">
                    Закрытые
                </div>
            </div>
        </div>
        

    </div>
</template>



<script >


// import component__header from '@/components/header.vue'





export default {

    data() {
        return {

            moneyBetValue: 10,
        }
    },

    props: {
        activStatus: Boolean
    },

    components: {
  
        
    },

    methods: {
   


    },

    computed: {

    },

    watch: {

    },

    mounted(){
        
    },

}
</script>